ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include <stdint.h>
#include "iMX6DQP_registers.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* SD2_DAT0 (coord A22), CHG_CAPGOOD */
#define BOARD_INITPINS_CHG_CAPGOOD_GPIO                                    GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CHG_CAPGOOD_GPIO_PIN                                  15U   /*!< GPIO1 pin index: 15 */
#define BOARD_INITPINS_CHG_CAPGOOD_PIN_NAME                             SD2_DAT0   /*!< Pin name */
#define BOARD_INITPINS_CHG_CAPGOOD_LABEL                           "CHG_CAPGOOD"   /*!< Label */
#define BOARD_INITPINS_CHG_CAPGOOD_NAME                            "CHG_CAPGOOD"   /*!< Identifier name */
#define BOARD_INITPINS_CHG_CAPGOOD_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

/* SD2_DAT2 (coord A23), CHG_ENABLE */
#define BOARD_INITPINS_CHG_ENABLE_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CHG_ENABLE_GPIO_PIN                                   13U   /*!< GPIO1 pin index: 13 */
#define BOARD_INITPINS_CHG_ENABLE_PIN_NAME                              SD2_DAT2   /*!< Pin name */
#define BOARD_INITPINS_CHG_ENABLE_LABEL                             "CHG_ENABLE"   /*!< Label */
#define BOARD_INITPINS_CHG_ENABLE_NAME                              "CHG_ENABLE"   /*!< Identifier name */
#define BOARD_INITPINS_CHG_ENABLE_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_2 (coord T1), CHG_PFW */
#define BOARD_INITPINS_CHG_PFW_GPIO                                        GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CHG_PFW_GPIO_PIN                                       2U   /*!< GPIO1 pin index: 2 */
#define BOARD_INITPINS_CHG_PFW_PIN_NAME                                   GPIO_2   /*!< Pin name */
#define BOARD_INITPINS_CHG_PFW_LABEL                                   "CHG_PFW"   /*!< Label */
#define BOARD_INITPINS_CHG_PFW_NAME                                    "CHG_PFW"   /*!< Identifier name */
#define BOARD_INITPINS_CHG_PFW_DIRECTION                 kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D29 (coord J19), PMIC_INT_B */
#define BOARD_INITPINS_PMIC_INT_B_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_PMIC_INT_B_GPIO_PIN                                   29U   /*!< GPIO3 pin index: 29 */
#define BOARD_INITPINS_PMIC_INT_B_PIN_NAME                               EIM_D29   /*!< Pin name */
#define BOARD_INITPINS_PMIC_INT_B_LABEL                             "PMIC_INT_B"   /*!< Label */
#define BOARD_INITPINS_PMIC_INT_B_NAME                              "PMIC_INT_B"   /*!< Identifier name */
#define BOARD_INITPINS_PMIC_INT_B_DIRECTION              kPIN_MUX_DirectionInput   /*!< Direction */

/* DISP0_DAT18 (coord V25), EN_PMIC_I2C */
#define BOARD_INITPINS_EN_PMIC_I2C_GPIO                                    GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_EN_PMIC_I2C_GPIO_PIN                                  12U   /*!< GPIO5 pin index: 12 */
#define BOARD_INITPINS_EN_PMIC_I2C_PIN_NAME                          DISP0_DAT18   /*!< Pin name */
#define BOARD_INITPINS_EN_PMIC_I2C_LABEL                           "EN_PMIC_I2C"   /*!< Label */
#define BOARD_INITPINS_EN_PMIC_I2C_NAME                            "EN_PMIC_I2C"   /*!< Identifier name */
#define BOARD_INITPINS_EN_PMIC_I2C_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D0 (coord A18), LED90 */
#define BOARD_INITPINS_LED90_GPIO                                          GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LED90_GPIO_PIN                                         0U   /*!< GPIO2 pin index: 0 */
#define BOARD_INITPINS_LED90_PIN_NAME                                   NANDF_D0   /*!< Pin name */
#define BOARD_INITPINS_LED90_LABEL                                       "LED90"   /*!< Label */
#define BOARD_INITPINS_LED90_NAME                                        "LED90"   /*!< Identifier name */
#define BOARD_INITPINS_LED90_DIRECTION                  kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D1 (coord C17), LED91 */
#define BOARD_INITPINS_LED91_GPIO                                          GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LED91_GPIO_PIN                                         1U   /*!< GPIO2 pin index: 1 */
#define BOARD_INITPINS_LED91_PIN_NAME                                   NANDF_D1   /*!< Pin name */
#define BOARD_INITPINS_LED91_LABEL                                       "LED91"   /*!< Label */
#define BOARD_INITPINS_LED91_NAME                                        "LED91"   /*!< Identifier name */
#define BOARD_INITPINS_LED91_DIRECTION                  kPIN_MUX_DirectionOutput   /*!< Direction */

