ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.h
/* NANDF_D2 (coord F16), LED92 */
#define BOARD_INITPINS_LED92_GPIO                                          GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LED92_GPIO_PIN                                         2U   /*!< GPIO2 pin index: 2 */
#define BOARD_INITPINS_LED92_PIN_NAME                                   NANDF_D2   /*!< Pin name */
#define BOARD_INITPINS_LED92_LABEL                                       "LED92"   /*!< Label */
#define BOARD_INITPINS_LED92_NAME                                        "LED92"   /*!< Identifier name */
#define BOARD_INITPINS_LED92_DIRECTION                  kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D3 (coord D17), LED93 */
#define BOARD_INITPINS_LED93_GPIO                                          GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LED93_GPIO_PIN                                         3U   /*!< GPIO2 pin index: 3 */
#define BOARD_INITPINS_LED93_PIN_NAME                                   NANDF_D3   /*!< Pin name */
#define BOARD_INITPINS_LED93_LABEL                                       "LED93"   /*!< Label */
#define BOARD_INITPINS_LED93_NAME                                        "LED93"   /*!< Identifier name */
#define BOARD_INITPINS_LED93_DIRECTION                  kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_1 (coord T4), USB_OTG_ID */
#define BOARD_INITPINS_USB_OTG_ID_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_USB_OTG_ID_GPIO_PIN                                    1U   /*!< GPIO1 pin index: 1 */
#define BOARD_INITPINS_USB_OTG_ID_PIN_NAME                                GPIO_1   /*!< Pin name */
#define BOARD_INITPINS_USB_OTG_ID_LABEL                             "USB_OTG_ID"   /*!< Label */
#define BOARD_INITPINS_USB_OTG_ID_NAME                              "USB_OTG_ID"   /*!< Identifier name */
#define BOARD_INITPINS_USB_OTG_ID_DIRECTION              kPIN_MUX_DirectionInput   /*!< Direction */

/* CSI0_DAT4 (coord N1), CAM1_TRIG */
#define BOARD_INITPINS_CAM1_TRIG_GPIO                                      GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_CAM1_TRIG_GPIO_PIN                                    22U   /*!< GPIO5 pin index: 22 */
#define BOARD_INITPINS_CAM1_TRIG_PIN_NAME                              CSI0_DAT4   /*!< Pin name */
#define BOARD_INITPINS_CAM1_TRIG_LABEL                               "CAM1_TRIG"   /*!< Label */
#define BOARD_INITPINS_CAM1_TRIG_NAME                                "CAM1_TRIG"   /*!< Identifier name */
#define BOARD_INITPINS_CAM1_TRIG_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* CSI0_DAT5 (coord P2), CAM1_STRB */
#define BOARD_INITPINS_CAM1_STRB_GPIO                                      GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_CAM1_STRB_GPIO_PIN                                    23U   /*!< GPIO5 pin index: 23 */
#define BOARD_INITPINS_CAM1_STRB_PIN_NAME                              CSI0_DAT5   /*!< Pin name */
#define BOARD_INITPINS_CAM1_STRB_LABEL                               "CAM1_STRB"   /*!< Label */
#define BOARD_INITPINS_CAM1_STRB_NAME                                "CAM1_STRB"   /*!< Identifier name */
#define BOARD_INITPINS_CAM1_STRB_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* CSI0_DAT6 (coord N4), CAM1_RST_n */
#define BOARD_INITPINS_CAM1_RST_n_GPIO                                     GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_CAM1_RST_n_GPIO_PIN                                   24U   /*!< GPIO5 pin index: 24 */
#define BOARD_INITPINS_CAM1_RST_n_PIN_NAME                             CSI0_DAT6   /*!< Pin name */
#define BOARD_INITPINS_CAM1_RST_n_LABEL                             "CAM1_RST_n"   /*!< Label */
#define BOARD_INITPINS_CAM1_RST_n_NAME                              "CAM1_RST_n"   /*!< Identifier name */
#define BOARD_INITPINS_CAM1_RST_n_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* CSI0_DAT7 (coord N3), CAM1_PWDN_n */
#define BOARD_INITPINS_CAM1_PWDN_n_GPIO                                    GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_CAM1_PWDN_n_GPIO_PIN                                  25U   /*!< GPIO5 pin index: 25 */
#define BOARD_INITPINS_CAM1_PWDN_n_PIN_NAME                            CSI0_DAT7   /*!< Pin name */
#define BOARD_INITPINS_CAM1_PWDN_n_LABEL                           "CAM1_PWDN_n"   /*!< Label */
#define BOARD_INITPINS_CAM1_PWDN_n_NAME                            "CAM1_PWDN_n"   /*!< Identifier name */
#define BOARD_INITPINS_CAM1_PWDN_n_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_16 (coord R2), CAM2_LFLT_n */
#define BOARD_INITPINS_CAM2_LFLT_n_GPIO                                    GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_CAM2_LFLT_n_GPIO_PIN                                  11U   /*!< GPIO7 pin index: 11 */
#define BOARD_INITPINS_CAM2_LFLT_n_PIN_NAME                              GPIO_16   /*!< Pin name */
#define BOARD_INITPINS_CAM2_LFLT_n_LABEL                           "CAM2_LFLT_n"   /*!< Label */
#define BOARD_INITPINS_CAM2_LFLT_n_NAME                            "CAM2_LFLT_n"   /*!< Identifier name */
#define BOARD_INITPINS_CAM2_LFLT_n_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_17 (coord R1), CAM2_RST */
#define BOARD_INITPINS_CAM2_RST_GPIO                                       GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_CAM2_RST_GPIO_PIN                                     12U   /*!< GPIO7 pin index: 12 */
#define BOARD_INITPINS_CAM2_RST_PIN_NAME                                 GPIO_17   /*!< Pin name */
#define BOARD_INITPINS_CAM2_RST_LABEL                                 "CAM2_RST"   /*!< Label */
#define BOARD_INITPINS_CAM2_RST_NAME                                  "CAM2_RST"   /*!< Identifier name */
#define BOARD_INITPINS_CAM2_RST_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_9 (coord T2), CAM2_LOCK */
#define BOARD_INITPINS_CAM2_LOCK_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CAM2_LOCK_GPIO_PIN                                     9U   /*!< GPIO1 pin index: 9 */
#define BOARD_INITPINS_CAM2_LOCK_PIN_NAME                                 GPIO_9   /*!< Pin name */
#define BOARD_INITPINS_CAM2_LOCK_LABEL                               "CAM2_LOCK"   /*!< Label */
#define BOARD_INITPINS_CAM2_LOCK_NAME                                "CAM2_LOCK"   /*!< Identifier name */
#define BOARD_INITPINS_CAM2_LOCK_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* CSI0_DATA_EN (coord P3), CAM2_ENPWR */
#define BOARD_INITPINS_CAM2_ENPWR_GPIO                                     GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_CAM2_ENPWR_GPIO_PIN                                   20U   /*!< GPIO5 pin index: 20 */
#define BOARD_INITPINS_CAM2_ENPWR_PIN_NAME                          CSI0_DATA_EN   /*!< Pin name */
#define BOARD_INITPINS_CAM2_ENPWR_LABEL                             "CAM2_ENPWR"   /*!< Label */
#define BOARD_INITPINS_CAM2_ENPWR_NAME                              "CAM2_ENPWR"   /*!< Identifier name */
#define BOARD_INITPINS_CAM2_ENPWR_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

