ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.h
/* GPIO_3 (coord R7), CPU_ENET_INTn */
#define BOARD_INITPINS_CPU_ENET_INTn_GPIO                                  GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CPU_ENET_INTn_GPIO_PIN                                 3U   /*!< GPIO1 pin index: 3 */
#define BOARD_INITPINS_CPU_ENET_INTn_PIN_NAME                             GPIO_3   /*!< Pin name */
#define BOARD_INITPINS_CPU_ENET_INTn_LABEL                       "CPU_ENET_INTn"   /*!< Label */
#define BOARD_INITPINS_CPU_ENET_INTn_NAME                        "CPU_ENET_INTn"   /*!< Identifier name */
#define BOARD_INITPINS_CPU_ENET_INTn_DIRECTION           kPIN_MUX_DirectionInput   /*!< Direction */

/* ENET_REF_CLK (coord V22), PHY_RSTn */
#define BOARD_INITPINS_PHY_RSTn_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_PHY_RSTn_GPIO_PIN                                     23U   /*!< GPIO1 pin index: 23 */
#define BOARD_INITPINS_PHY_RSTn_PIN_NAME                            ENET_REF_CLK   /*!< Pin name */
#define BOARD_INITPINS_PHY_RSTn_LABEL                                 "PHY_RSTn"   /*!< Label */
#define BOARD_INITPINS_PHY_RSTn_NAME                                  "PHY_RSTn"   /*!< Identifier name */
#define BOARD_INITPINS_PHY_RSTn_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* KEY_ROW4 (coord V5), REMOTE_RST */
#define BOARD_INITPINS_REMOTE_RST_GPIO                                     GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_REMOTE_RST_GPIO_PIN                                   15U   /*!< GPIO4 pin index: 15 */
#define BOARD_INITPINS_REMOTE_RST_PIN_NAME                              KEY_ROW4   /*!< Pin name */
#define BOARD_INITPINS_REMOTE_RST_LABEL                             "REMOTE_RST"   /*!< Label */
#define BOARD_INITPINS_REMOTE_RST_NAME                              "REMOTE_RST"   /*!< Identifier name */
#define BOARD_INITPINS_REMOTE_RST_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_4 (coord R6), USB_PWREN */
#define BOARD_INITPINS_USB_PWREN_GPIO                                      GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_USB_PWREN_GPIO_PIN                                     4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITPINS_USB_PWREN_PIN_NAME                                 GPIO_4   /*!< Pin name */
#define BOARD_INITPINS_USB_PWREN_LABEL                               "USB_PWREN"   /*!< Label */
#define BOARD_INITPINS_USB_PWREN_NAME                                "USB_PWREN"   /*!< Identifier name */
#define BOARD_INITPINS_USB_PWREN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_5 (coord R4), USB_RESETn */
#define BOARD_INITPINS_USB_RESETn_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_USB_RESETn_GPIO_PIN                                    5U   /*!< GPIO1 pin index: 5 */
#define BOARD_INITPINS_USB_RESETn_PIN_NAME                                GPIO_5   /*!< Pin name */
#define BOARD_INITPINS_USB_RESETn_LABEL                             "USB_RESETn"   /*!< Label */
#define BOARD_INITPINS_USB_RESETn_NAME                              "USB_RESETn"   /*!< Identifier name */
#define BOARD_INITPINS_USB_RESETn_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* KEY_COL4 (coord T6), UX_PWR_EN */
#define BOARD_INITPINS_UX_PWR_EN_GPIO                                      GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_UX_PWR_EN_GPIO_PIN                                    14U   /*!< GPIO4 pin index: 14 */
#define BOARD_INITPINS_UX_PWR_EN_PIN_NAME                               KEY_COL4   /*!< Pin name */
#define BOARD_INITPINS_UX_PWR_EN_LABEL                               "UX_PWR_EN"   /*!< Label */
#define BOARD_INITPINS_UX_PWR_EN_NAME                                "UX_PWR_EN"   /*!< Identifier name */
#define BOARD_INITPINS_UX_PWR_EN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D16 (coord C25), UX_5V_OC */
#define BOARD_INITPINS_UX_5V_OC_GPIO                                       GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_UX_5V_OC_GPIO_PIN                                     16U   /*!< GPIO3 pin index: 16 */
#define BOARD_INITPINS_UX_5V_OC_PIN_NAME                                 EIM_D16   /*!< Pin name */
#define BOARD_INITPINS_UX_5V_OC_LABEL                                 "UX_5V_OC"   /*!< Label */
#define BOARD_INITPINS_UX_5V_OC_NAME                                  "UX_5V_OC"   /*!< Identifier name */
#define BOARD_INITPINS_UX_5V_OC_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* KEY_COL2 (coord W6), UX_GSTIC_RSTn */
#define BOARD_INITPINS_UX_GSTIC_RSTn_GPIO                                  GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_UX_GSTIC_RSTn_GPIO_PIN                                10U   /*!< GPIO4 pin index: 10 */
#define BOARD_INITPINS_UX_GSTIC_RSTn_PIN_NAME                           KEY_COL2   /*!< Pin name */
#define BOARD_INITPINS_UX_GSTIC_RSTn_LABEL                       "UX_GSTIC_RSTn"   /*!< Label */
#define BOARD_INITPINS_UX_GSTIC_RSTn_NAME                        "UX_GSTIC_RSTn"   /*!< Identifier name */
#define BOARD_INITPINS_UX_GSTIC_RSTn_DIRECTION          kPIN_MUX_DirectionOutput   /*!< Direction */

/* KEY_ROW2 (coord W4), UX_GSTIC_TS */
#define BOARD_INITPINS_UX_GSTIC_TS_GPIO                                    GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_UX_GSTIC_TS_GPIO_PIN                                  11U   /*!< GPIO4 pin index: 11 */
#define BOARD_INITPINS_UX_GSTIC_TS_PIN_NAME                             KEY_ROW2   /*!< Pin name */
#define BOARD_INITPINS_UX_GSTIC_TS_LABEL                           "UX_GSTIC_TS"   /*!< Label */
#define BOARD_INITPINS_UX_GSTIC_TS_NAME                            "UX_GSTIC_TS"   /*!< Identifier name */
#define BOARD_INITPINS_UX_GSTIC_TS_DIRECTION            kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D25 (coord G22), RS485_DE */
#define BOARD_INITPINS_RS485_DE_GPIO                                       GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_RS485_DE_GPIO_PIN                                     25U   /*!< GPIO3 pin index: 25 */
#define BOARD_INITPINS_RS485_DE_PIN_NAME                                 EIM_D25   /*!< Pin name */
#define BOARD_INITPINS_RS485_DE_LABEL                                 "RS485_DE"   /*!< Label */
#define BOARD_INITPINS_RS485_DE_NAME                                  "RS485_DE"   /*!< Identifier name */
#define BOARD_INITPINS_RS485_DE_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

