ChargePoint/emb-uboot-imx/board/chargepoint/imx6cpnk/pin_mux.h
/* EIM_D28 (coord G23), RS485_REn */
#define BOARD_INITPINS_RS485_REn_GPIO                                      GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_RS485_REn_GPIO_PIN                                    28U   /*!< GPIO3 pin index: 28 */
#define BOARD_INITPINS_RS485_REn_PIN_NAME                                EIM_D28   /*!< Pin name */
#define BOARD_INITPINS_RS485_REn_LABEL                               "RS485_REn"   /*!< Label */
#define BOARD_INITPINS_RS485_REn_NAME                                "RS485_REn"   /*!< Identifier name */
#define BOARD_INITPINS_RS485_REn_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_6 (coord T3), SER_PWR_EN */
#define BOARD_INITPINS_SER_PWR_EN_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SER_PWR_EN_GPIO_PIN                                    6U   /*!< GPIO1 pin index: 6 */
#define BOARD_INITPINS_SER_PWR_EN_PIN_NAME                                GPIO_6   /*!< Pin name */
#define BOARD_INITPINS_SER_PWR_EN_LABEL                             "SER_PWR_EN"   /*!< Label */
#define BOARD_INITPINS_SER_PWR_EN_NAME                              "SER_PWR_EN"   /*!< Identifier name */
#define BOARD_INITPINS_SER_PWR_EN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D19 (coord G21), WIF_PWREN */
#define BOARD_INITPINS_WIF_PWREN_GPIO                                      GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_WIF_PWREN_GPIO_PIN                                    19U   /*!< GPIO3 pin index: 19 */
#define BOARD_INITPINS_WIF_PWREN_PIN_NAME                                EIM_D19   /*!< Pin name */
#define BOARD_INITPINS_WIF_PWREN_LABEL                               "WIF_PWREN"   /*!< Label */
#define BOARD_INITPINS_WIF_PWREN_NAME                                "WIF_PWREN"   /*!< Identifier name */
#define BOARD_INITPINS_WIF_PWREN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D20 (coord G20), WIF_RESETn */
#define BOARD_INITPINS_WIF_RESETn_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_WIF_RESETn_GPIO_PIN                                   20U   /*!< GPIO3 pin index: 20 */
#define BOARD_INITPINS_WIF_RESETn_PIN_NAME                               EIM_D20   /*!< Pin name */
#define BOARD_INITPINS_WIF_RESETn_LABEL                             "WIF_RESETn"   /*!< Label */
#define BOARD_INITPINS_WIF_RESETn_NAME                              "WIF_RESETn"   /*!< Identifier name */
#define BOARD_INITPINS_WIF_RESETn_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D23 (coord D25), MOD_PWREN */
#define BOARD_INITPINS_MOD_PWREN_GPIO                                      GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MOD_PWREN_GPIO_PIN                                    23U   /*!< GPIO3 pin index: 23 */
#define BOARD_INITPINS_MOD_PWREN_PIN_NAME                                EIM_D23   /*!< Pin name */
#define BOARD_INITPINS_MOD_PWREN_LABEL                               "MOD_PWREN"   /*!< Label */
#define BOARD_INITPINS_MOD_PWREN_NAME                                "MOD_PWREN"   /*!< Identifier name */
#define BOARD_INITPINS_MOD_PWREN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D24 (coord F22), MOD_RESETn */
#define BOARD_INITPINS_MOD_RESETn_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_MOD_RESETn_GPIO_PIN                                   24U   /*!< GPIO3 pin index: 24 */
#define BOARD_INITPINS_MOD_RESETn_PIN_NAME                               EIM_D24   /*!< Pin name */
#define BOARD_INITPINS_MOD_RESETn_LABEL                             "MOD_RESETn"   /*!< Label */
#define BOARD_INITPINS_MOD_RESETn_NAME                              "MOD_RESETn"   /*!< Identifier name */
#define BOARD_INITPINS_MOD_RESETn_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_18 (coord P6), MOD_IGTn */
#define BOARD_INITPINS_MOD_IGTn_GPIO                                       GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_MOD_IGTn_GPIO_PIN                                     13U   /*!< GPIO7 pin index: 13 */
#define BOARD_INITPINS_MOD_IGTn_PIN_NAME                                 GPIO_18   /*!< Pin name */
#define BOARD_INITPINS_MOD_IGTn_LABEL                                 "MOD_IGTn"   /*!< Label */
#define BOARD_INITPINS_MOD_IGTn_NAME                                  "MOD_IGTn"   /*!< Identifier name */
#define BOARD_INITPINS_MOD_IGTn_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_19 (coord P5), MOD_PWRIND */
#define BOARD_INITPINS_MOD_PWRIND_GPIO                                     GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_MOD_PWRIND_GPIO_PIN                                    5U   /*!< GPIO4 pin index: 5 */
#define BOARD_INITPINS_MOD_PWRIND_PIN_NAME                               GPIO_19   /*!< Pin name */
#define BOARD_INITPINS_MOD_PWRIND_LABEL                             "MOD_PWRIND"   /*!< Label */
#define BOARD_INITPINS_MOD_PWRIND_NAME                              "MOD_PWRIND"   /*!< Identifier name */
#define BOARD_INITPINS_MOD_PWRIND_DIRECTION              kPIN_MUX_DirectionInput   /*!< Direction */

/* DISP0_DAT9 (coord T25), LCD_3V3_EN */
#define BOARD_INITPINS_LCD_3V3_EN_GPIO                                     GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_LCD_3V3_EN_GPIO_PIN                                   30U   /*!< GPIO4 pin index: 30 */
#define BOARD_INITPINS_LCD_3V3_EN_PIN_NAME                            DISP0_DAT9   /*!< Pin name */
#define BOARD_INITPINS_LCD_3V3_EN_LABEL                             "LCD_3V3_EN"   /*!< Label */
#define BOARD_INITPINS_LCD_3V3_EN_NAME                              "LCD_3V3_EN"   /*!< Identifier name */
#define BOARD_INITPINS_LCD_3V3_EN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* DISP0_DAT0 (coord P24), LCD_BLU_EN */
#define BOARD_INITPINS_LCD_BLU_EN_GPIO                                     GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_LCD_BLU_EN_GPIO_PIN                                   21U   /*!< GPIO4 pin index: 21 */
#define BOARD_INITPINS_LCD_BLU_EN_PIN_NAME                            DISP0_DAT0   /*!< Pin name */
#define BOARD_INITPINS_LCD_BLU_EN_LABEL                             "LCD_BLU_EN"   /*!< Label */
#define BOARD_INITPINS_LCD_BLU_EN_NAME                              "LCD_BLU_EN"   /*!< Identifier name */
#define BOARD_INITPINS_LCD_BLU_EN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* DISP0_DAT1 (coord P22), LCD_REV_SCAN */
#define BOARD_INITPINS_LCD_REV_SCAN_GPIO                                   GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_LCD_REV_SCAN_GPIO_PIN                                 22U   /*!< GPIO4 pin index: 22 */
#define BOARD_INITPINS_LCD_REV_SCAN_PIN_NAME                          DISP0_DAT1   /*!< Pin name */
#define BOARD_INITPINS_LCD_REV_SCAN_LABEL                         "LCD_REV_SCAN"   /*!< Label */
#define BOARD_INITPINS_LCD_REV_SCAN_NAME                          "LCD_REV_SCAN"   /*!< Identifier name */
#define BOARD_INITPINS_LCD_REV_SCAN_DIRECTION           kPIN_MUX_DirectionOutput   /*!< Direction */

/* DISP0_DAT2 (coord P23), LCD_SEL_6OR8 */
#define BOARD_INITPINS_LCD_SEL_6OR8_GPIO                                   GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_LCD_SEL_6OR8_GPIO_PIN                                 23U   /*!< GPIO4 pin index: 23 */
#define BOARD_INITPINS_LCD_SEL_6OR8_PIN_NAME                          DISP0_DAT2   /*!< Pin name */
#define BOARD_INITPINS_LCD_SEL_6OR8_LABEL                         "LCD_SEL_6OR8"   /*!< Label */
#define BOARD_INITPINS_LCD_SEL_6OR8_NAME                          "LCD_SEL_6OR8"   /*!< Identifier name */
#define BOARD_INITPINS_LCD_SEL_6OR8_DIRECTION           kPIN_MUX_DirectionOutput   /*!< Direction */

/* DISP0_DAT4 (coord P20), SPK_PWREN */
#define BOARD_INITPINS_SPK_PWREN_GPIO                                      GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_SPK_PWREN_GPIO_PIN                                    25U   /*!< GPIO4 pin index: 25 */
#define BOARD_INITPINS_SPK_PWREN_PIN_NAME                             DISP0_DAT4   /*!< Pin name */
#define BOARD_INITPINS_SPK_PWREN_LABEL                               "SPK_PWREN"   /*!< Label */
#define BOARD_INITPINS_SPK_PWREN_NAME                                "SPK_PWREN"   /*!< Identifier name */
#define BOARD_INITPINS_SPK_PWREN_DIRECTION              kPIN_MUX_DirectionOutput   /*!< Direction */

/* DISP0_DAT3 (coord P21), USON_PWREN */
#define BOARD_INITPINS_USON_PWREN_GPIO                                     GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_USON_PWREN_GPIO_PIN                                   24U   /*!< GPIO4 pin index: 24 */
#define BOARD_INITPINS_USON_PWREN_PIN_NAME                            DISP0_DAT3   /*!< Pin name */
#define BOARD_INITPINS_USON_PWREN_LABEL                             "USON_PWREN"   /*!< Label */
#define BOARD_INITPINS_USON_PWREN_NAME                              "USON_PWREN"   /*!< Identifier name */
#define BOARD_INITPINS_USON_PWREN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: Cortex-A9 (Core #0)[ca9_0] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
